{
  "title": "Knowit Objectnet Fagseminar våren 2017",
          "event": {
            "date": "31. mars - 2. april 2017",
            "longDate": "31. mars - 2. april 2017",
            "venue": "Crowne Plaza Berlin City Centre",
            "city": "Berlin",
            "country": "Tyskland",
            "gmapsUrl": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d4026.7761289080663!2d13.340015104851592!3d52.502478744744764!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x47a8505452cd134d%3A0x25283f2211ca3f42!2sCrowne+Plaza+Berlin+City+Centre!5e0!3m2!1sen!2sno!4v1484909369498"
          },
          "schedules": [
            {
              "day": "Lørdag 1. april",
              "collections": [
                {
                  "time": "10:00-11.00 Keynote",
                  "entries": [
                    {
                      "room": "Rom 1",
                      "slots": [
                        "eksternt_foredrag"
                      ]
                    }
                    ]
                    },
                    {
                  "time": "11:15-12:30 Korte foredrag (intro til workshops)",
                  "entries": [
                    {
                      "room": "Rom 1",
                      "slots": [
                        "maskinlaring",
                        "blockchain",
                        "frontend",
                        "cloud",
                        "lean"
                      ]
                    }
                    ]
                    },
                    {
         			 "time": "12:30-13:00 Quiz",
			          "entries": [
    	    		    {
			              "room": "Rom 1",
        			      "slots": [
                			"quiz"
		            	  ]
	    		        }
    	    		  ]
	    	    	},
	    	    	{
         			 "time": "13:00-14:00 Lunsj",
               "isBreak": true
	    	    	},
	    	    	{
         			 "time": "14:00-19:30 Ikke-faglige aktiviteter",
               "isBreak": true
	    	    	},
	    	    	{
         			 "time": "19:30 Middag",
               "isBreak": true
	    	    	}
                  ]
                },
    {
      "day": "Søndag 2. april",
      "collections": [
        {
          "time": "10:00-10:10 God morgen 😴",
          "entries": [
            {
              "room": "Felles",
              "slots": [
                "fagstrategi"
              ]
            }
          ]
        },
        {
          "time": "10:10-10:15 Pause",
          "isBreak": true
        },
        {
          "time": "10:15-15:00 Fag (Workshops)",
          "entries": [
            {
              "room": "Rom 1",
              "slots": [
                "ml_ws"
              ]
            },
            {
              "room": "Rom 2",
              "slots": [
                "blockchain_ws"
              ]
            },
            {
              "room": "Rom 3",
              "slots": [
                "frontend_ws"
              ]
            }
          ]
        },
        {
          "time": "10:15-15:00 Fag (Workshops)",
          "entries": [
              {
              "room": "Rom 4",
              "slots": [
                "elm_ws"
              ]
            },
                        {
              "room": "Rom 5",
              "slots": [
                "cloud_ws"
              ]
            },
                        {
              "room": "Rom 6",
              "slots": [
                "lean_ws"
              ]
            }
          ]
        },
	    {
		 "time": "15:00 Pakking, avreise til fly (stopp for lunsj på veien)",
          "entries": [
  		    {
             "room": "",
		      "slots": [
      			""
          	  ]
	        }
  		  ]
   		}
      ]
    }
  ],
  "talks": {
    "fagstrategi": {
      "pending": false,
      "speakers": [
        {
          "name": "Jan Henrik Gundelsby",
          "bio": "Jan Henrik er fagsjef i Knowit Objectnet. Jobber for tiden litt hos Oslo kommune med arkitektur og prosess. Driver også med salg, marked og hvordan vi skal få de rette nye prosjektene. Glad i naturen og lidenskapelig opptatt av fag!",
          "pic": "jhg.jpg",
          "email": "jhg@knowit.no"
        },
        {
          "name": "Haakon Spilde",
          "bio": "Haakon er fagsjef i Knowit Objectnet. Haakon er lidenskapelig opptatt av prosess og metode, med særlig fokus på Agile teknikker. Hvordan lære av sine feil, hvordan endre sine metoder og prosesser til det bedre og hvordan få et team til å fungere optimalt er tema som opptar Haakon.",
          "pic": "hfs.jpg",
          "email": "hfs@knowit.no"
        }
      ],
      "title": "God morgen!",
      "type": "Intro (15 min)",
      "description": "God morgen alle sammen! Praktisk informasjon."
    },
    "quiz": {
      "pending": false,
      "speakers": [
        {
          "name": "Joakim Lehn",
          "bio": "Joakim Lehn er den offisielle maskoten fra trønderlag for knowit. Villtrønderen har lovet å ikke bare ha spørsmål om RBK, samt prøve å få med noen temaer man har hørt om sør for Dovre.",
          "pic": "joakim.lehn.jpg",
          "email": "joakim.lehn@knowit.no"
        }
      ],
      "title": "Quiz",
      "type": "quiz",
      "description": "Svar på Kahoot-quizen så godt du kan for å komme på riktig restaurant på kvelden..."
    },
    "ml_ws": {
      "pending": false,
      "speakers": [
        {
          "name": "Ole Grashei",
          "bio": "Ole gikk ut fra NTNU i 2013 med en sivilingeniørgrad i datateknikk. Fra forvaltningsprosjekter har han fått innsikt i komplekse foretningsapplikasjoner og prosjektprosessen. Gjennom sine prosjekt-engasjementer i NSB har Ole vært involvert både i kjerne-billettsystem (Java-utvikling) og salgskanalen for konduktører (Android-utvikling for Mobile Terminaler / smarttelefon). Ole faglig interessert og er jevnlig å se på meetups om utvikling, arkitektur og maskinlæring.",
          "pic": "olegra_knowit.no.jpg",
          "email": "olegra@knowit.no"
        },
        {
          "name": "Johan Reitan",
          "bio": "Johan er en systemutvikler med master i Datateknikk ved NTNU der han spesialiserte seg i kunstig intelligens. Hovedinteressen har vært maskinlæring, gjerne sammen med språkteknologi, som han har jobbet mye med. Linux og åpen kildekode er en lidenskap, og mye av fritiden hans går med på eksperimentering med og bidrag til åpne prosjekter. Han har mye erfaring med Android, Java og Kotlin, inkludert Android TV og Android Things, samt Python og diverse Python-rammeverk, men har også jobbet med .NET.",
          "pic": "Johan.Reitan.300x375.jpg",
          "email": "johan.reitan@knowit.no"
        },
        {
          "name": "Patrik Bakken",
          "bio": "Patrik startet i Knowit Objecnet i august 2016 etter 3 år i USA på Illinois State University, og 3 år på NTNU i Trondheim hvor mastergraden ble fullført. Kjernekompetansen ligger i back-end utvikling i språk som bl.a. Java og C++. Patrik er veldig interessert i å lære og ser alltid etter nye utfordringer.",
          "pic": "Patrik.Fridberg.Bakken.300x375.jpg",
          "email": "patrik.bakken@knowit.no"
        },
        {
          "name": "Stian Lågstad",
          "bio": "Stian ble uteksaminert fra Universitetet i Oslo i juni 2016 med A på masteroppgaven i bioinformatikk. Gjennom studiene har han fått erfaring med Python, R, Java, LISP, og gjennom deltidsjobben som konsulent for Realfagsbiblioteket jobbet han mye med Javascript. Hos Knowit Objectnet gikk han inn i LISA-prosjektet hos NSB, der han jobber med Java og rammeverk som Spring og Feign.",
          "pic": "stian.lagstad.jpg",
          "email": "stian.lagstad@knowit.no"
        }
      ],
      "title": "Bli en vinkjenner ved hjelp av maskinlæring. Helt utrolig! Klikk her for å se hvordan",
      "type": "Workshop (4.5 timer)",
      "description": "I denne workshoppen skal vi ta en litt annerledes tilnærming til vinsmaking: Klarer vi å forutse vin-ratings ved hjelp av maskinlæring? Vi skal innom kjente algoritmer slik som nearest neighbour, random forests og support vector machines - alt i vår jakt etter å bli bedre vinkjennere. Dette blir en god blanding av teori og praksis: Deltagerne jobber sammen i lag for å løse oppgaver med python, scikit og andre godsaker, mens Ole, Patrik, Johan og Stian sørger for at dere får teorien som trengs underveis. Vel møtt!"
    },
    "blockchain_ws": {
      "pending": false,
      "speakers": [
        {
          "name": "Simen Skoglund og Sigurd Lund",
          "bio": "Den beryktede duoen har stadig nye idéer om hvordan blockchain skal revolusjonere verden, men så langt så har de lite å vise til av applikasjoner som er tilgjengelig for de store massene. Nå har de derimot noe stort på gang, så sørg for å få med deg workshopen om blockchain!",
          "pic": "sigsko.png",
          "email": "epost"
        }
      ],
      "title": "Kontopenger på Blockchain?!",
      "type": "Workshop (4.5 timer)",
      "description": "De har gjort revolusjonerende forskning på blockchain, og har nå funnet ut av hvordan Objectnets konto-ordning kan representeres på denne teknologien. Ved hjelp av blokkjeden Ethereum og rammeverket Truffle skal de hjelpe deg å få til dette på noen timer."
    },
    "frontend_ws": {
      "pending": false,
      "speakers": [
        {
          "name": "Christian Peter",
          "bio": "Frontend utvikling er det Christian brenner mest for. Å kombinere tanker fra både designere og utviklere er det som skal til for å skape et frontend der brukeren trives. Denne interessen er noe Christian fikk mot slutten av studiene. Han syntes det også er spennende å utvikle backend systemer i kombinasjon med frontend. Ved å utvikle både backend og frontend får man en helhets forståelse der sluttresultatet blir bedre. Christian liker selv å kalle seg en fullstack-utvikler. I tillegg til utvikling, finner Christian det svært interessant å interaktere med kunden slik at man kommer frem til den beste løsningen.",
          "pic": "cp.jpg",
          "email": "christian.peter@knowit.no"
        },
        {
          "name": "Kennet Vuong",
          "bio": "Kennet er en ivrig utvikler som stadig er på jakt etter nye utfordringer og teknologier. Han ser på seg selv som en full-stack utvikler som trives godt både på fremsia med web- og mobilutvikling og på baksia med database- og serverapplikasjoner. Gjennom tidligere erfaringer har Kennet jobbet som DevOps-utvikler og objektorientert systemutvikling innenfor JVM. I tillegg har han vært scrum master og team- og techlead innenfor frontend. Kennet liker å jobbe i team i tett samarbeid med kunder og designere.",
          "pic": "kennet.vuong.jpg",
          "email": "kennet.vuong@knowit.no"
        },
        {
          "name": "Alexander Bjerkan",
          "bio": "Alexander har god erfaring som systemutvikler i smidige team og har bygget opp betydelig kompetanse innenfor et bredt spekter av teknologier og ansvarsområder. Han har jobbet med alt fra små hobbyprosjekter til store samfunnskritiske systemer og han brenner for håndverket og kvaliteten i IT-faget. Som person søker Alexander stadig å utvikle sin tekniske horisont med nye teknologier og kunnskap.",
          "pic": "alb_knowit.no.jpg",
          "email": "alb@knowit.no"
        },
        {
          "name": "Johannes Akse",
          "bio": "Johannes har en mastergrad i 'Informatikk: Design, bruk og interaksjon' men foretrekker å programmere og da helst front-end. Han har to bachelorgrader: den første i 'Kultur og kommunikasjon' fra Universitetet i Oslo og den andre i 'Digital medieproduksjon' fra Høgskolen i Østfold. Dette har gitt et godt grunnlag for å forstå informasjonsflyt, både mellommenneskelig men også mellom menneske og maskin.",
          "pic": "johannes.akse.jpg",
          "email": "johannes.akse@knowit.no"
        }
      ],
      "title": "React",
      "type": "Workshop (4.5 timer)",
      "description": "Er du lei av å høre om hvor fantastisk revolusjonerende React er uten å vite hva det egentlig dreier seg om? Eller vil du kanskje bare ha en enkel innføring i hvordan man kan utvikle en web-applikasjon? I denne workshopen vil vi oppfylle begge disse innfallsvinklene. Vi går gjennom de viktigste React konseptene ved å starte helt fra begynnelsen. Sammen vil vi bygge en liten applikasjon som illustrerer dataflyten i React, og hvordan en komponentmodell lar oss presentere data på en lett forståelig og effektiv måte."
    },
    "elm_ws": {
      "pending": false,
      "speakers": [
        {
          "name": "Runar Furunes",
          "bio": "Runar hadde sommerjobb i Knowit i 2011. Etter endt utdannelse jobbet han et halvt år i statlig sektor, før han begynte i fast stilling hos Knowit desember 2013. Han har erfaring med ulike programmeringsspråk og teknologier, og er spesielt opptatt av funksjonell programmering.",
          "pic": "ruf.jpg",
          "email": "ruf@knowit.no"
        }
      ],
      "title": "Praktisk introduksjon til Elm",
      "type": "Workshop (4.5 timer)",
      "description": ""
    },
    "cloud_ws": {
      "pending": false,
      "speakers": [
        {
          "name": "Kenneth Stigen",
          "bio": "Kenneth har jobbet i som konsulent siden 2004, og i Knowit Objectnet siden januar 2010. Kenneth har sin kjernekompetanse innenfor arkitektur og utvikling av store løsninger på java-plattformen.",
          "pic": "kes_knowit.no.jpg",
          "email": "kes@knowit.no"
        }
      ],
      "title": "Serverless Tank Wars Battle",
      "type": "Workshop (4.5 timer)",
      "description": "En workshop hvor du vil lære om serverless infrastruktur i skyen og programmering av virtuelle tanks. Vi vil bruke skytjenester tilbudt av Amazon Web Services, som AWS Lambda og AWS API Gateway som vil hoste et enkelt API for å slåss med tanks. APIet vil implementere et grensesnitt definert av et spill, Tank Wars. I dette APIet vil du implementere en enkel kunstig intelligens som, i en uhøytidelig konkurranse, vil slåss mot andre implementasjoner mot slutten av workshopen."
    },
    "lean_ws": {
      "pending": false,
      "speakers": [
        {
          "name": "Michael Johansen",
          "bio": "A software consultant during the day and a startup founder during the night. At NTNU I studied entrepreneurship, computer science and psychology. As part of my startup venture I've gotten first-hand experience with the startup scene in both Boston and in Silicon Valley. I care more than most people about startups, and it's a topic on which I'd like to share my insights.",
          "pic": "mjo.jpg",
          "email": "mjo@knowit.no"
        }
      ],
      "title": "Startups For Grownups",
      "type": "Workshop (4.5 timer)",
      "description": "We all have a business idea. Few people try to build a startup around it and fewer yet succeed. Successful startups like Tesla, Uber and AirBnB are the fabled creatures of the 3rd millennium. But how exactly does an idea become a business? And how can you be sure that anyone wants what you’re selling? We’ll explore a methodical approach to starting up, and discover how this is relevant to our business in Knowit Objectnet."
    },
    "maskinlaring": {
      "pending": false,
      "speakers": [
        {
          "name": "Simen Skoglund og Sigurd Lund",
          "bio": "Den beryktede duoen har stadig nye idéer om hvordan blockchain skal revolusjonere verden, men så langt så har de lite å vise til av applikasjoner som er tilgjengelig for de store massene. Nå har de derimot noe stort på gang, så sørg for å få med deg workshopen om blockchain!",
          "pic": "sigsko.png",
          "email": "epost"
        }
      ],
      "title": "Intro til workshop om maskinlæring",
      "type": "Foredrag (15 min)"
    },
    "blockchain": {
      "pending": false,
      "speakers": [
        {
          "name": "Simen Skoglund og Sigurd Lund",
          "bio": "Den beryktede duoen har stadig nye idéer om hvordan blockchain skal revolusjonere verden, men så langt så har de lite å vise til av applikasjoner som er tilgjengelig for de store massene. Nå har de derimot noe stort på gang, så sørg for å få med deg workshopen om blockchain!",
          "pic": "sigsko.png",
          "email": "epost"
        }
      ],      
      "title": "Intro til workshop om blockchain",
      "type": "Foredrag (15 min)"
    },
    "eksternt_foredrag": {
      "pending": false,
      "speakers": [
        {
          "name": "Christian Mikaelsen",
          "bio": "Christian Mikalsen er teknologisjef og en av gründerne bak suksessbedriften kolonial.no. Christian har informatikk-bakgrunn fra Universitet i Oslo, og har mange års erfaring fra kryssfunksjonelle IT-prosjekter.",
          "pic": "christianm.jpg",
          "email": "christian@kolonial.no"
        }
      ],
      "title": "Tverrfaglig teamarbeid i kolonial.no",
      "type": "Keynote (60 min)",
      "description": "Kolonial.no er Norges største matbutikk på nett, og Nordens raskest voksende dagligvareselskap på nett. Christian Mikalsen er teknologisjef og en av gründerne bak suksessbedriften. Den tverrfaglige hverdagen og samhandlingen mellom det digitale og det fysiske er en av hovedutfordringene i Christians hverdag, og en av styrkene til gründerteamet."
    },
    "frontend": {
      "pending": false,
      "speakers": [
        {
          "name": "Christoffer Eliesen",
          "bio": "Christoffer er en engasjert utvikler som brenner for IT. Han er nysgjerrig og glad i å lære nye ting. Han stiller høye krav til seg selv og det han leverer, men er pragmatisk når det trengs. Hans interesse for IT spenner seg hele veien fra operativsystem til brukergrensesnitt, og han er derfor en naturlig fullstack og 'devops' utvikler. I disse tider er det frontend som er i vinden og Christoffers hjerte følger etter. React og Node er spennende teknologier som passer han midt i blinken. Både 'gammel' jQuery og ny React er teknologier som er givende å jobbe med for Christoffer. Flere års erfaring har gjort han trygg i rollen som konsulent. Han er beskjeden, samtidig som han er en dyp tenker med rolige øyne og et brennende hjerte.",
          "pic": "christoffer.eliesen.JPG",
          "email": "christoffer.eliesen@knowit.no"
        },
        {
          "name": "Runar Furunes",
          "bio": "Runar hadde sommerjobb i Knowit i 2011. Etter endt utdannelse jobbet han et halvt år i statlig sektor, før han begynte i fast stilling hos Knowit desember 2013. Han har erfaring med ulike programmeringsspråk og teknologier, og er spesielt opptatt av funksjonell programmering.",
          "pic": "ruf.jpg",
          "email": "ruf@knowit.no"
        }
      ],
      "title": "Intro til workshops frontend/web (Elm og React)",
      "type": "Foredrag (15 min)",
      "description": "Har du lyst til å bli frontstykkeutvikler på verdensveven? Vet du hva det egentlig innebærer? Det vet vi, og vi gir et innblikk i det komplekse beistet som venter i edderkoppnettet. I tillegg vil Runar kort fortelle om hvordan det behagelige livet er i Elm-land for tiden."
    },
    "lean": {
      "pending": false,
      "speakers": [
        {
          "name": "Michael Johansen",
          "bio": "A software consultant during the day and a startup founder during the night. At NTNU I studied entrepreneurship, computer science and psychology. As part of my startup venture I've gotten first-hand experience with the startup scene in both Boston and in Silicon Valley. I care more than most people about startups, and it's a topic on which I'd like to share my insights.",
          "pic": "mjo.jpg",
          "email": "mjo@knowit.no"
        }
      ],
      "title": "Intro til workshop om Lean startup",
      "type": "Foredrag (15 min)",
      "description": "We all have a business idea. But how exactly does an idea become a business? And how can you be sure that anyone wants what you’re selling? Discover how this is relevant to Knowit Objectnet."
    },
    "cloud": {
      "pending": false,
      "speakers": [
        {
          "name": "Kenneth Stigen",
          "bio": "Kenneth har jobbet i som konsulent siden 2004, og i Knowit Objectnet siden januar 2010. Kenneth har sin kjernekompetanse innenfor arkitektur og utvikling av store løsninger på java-plattformen.",
          "pic": "kes_knowit.no.jpg",
          "email": "kes@knowit.no"
        }
      ],
      "title": "Intro til serverless / cloud-workshop",
      "type": "Foredrag (15 min)",
      "description": "En workshop hvor du vil lære om serverless infrastruktur i skyen og programmering av virtuelle tanks. Vi vil bruke skytjenester tilbudt av Amazon Web Services, som AWS Lambda og AWS API Gateway som vil hoste et enkelt API for å slåss med tanks. APIet vil implementere et grensesnitt definert av et spill, Tank Wars. I dette APIet vil du implementere en enkel kunstig intelligens som, i en uhøytidelig konkurranse, vil slåss mot andre implementasjoner mot slutten av workshopen."
    }
  }
}
